### Terraform plan (dev) — completed

<details><summary>Show plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_integration.cors has changed
  ~ resource "aws_api_gateway_integration" "cors" {
      + cache_key_parameters    = []
        id                      = "agi-l0w9e121i5-xsytmr-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.cors_todo has changed
  ~ resource "aws_api_gateway_integration" "cors_todo" {
      + cache_key_parameters    = []
        id                      = "agi-l0w9e121i5-6f1z0j-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.cors has changed
  ~ resource "aws_api_gateway_integration_response" "cors" {
        id                  = "agir-l0w9e121i5-xsytmr-OPTIONS-200"
      + response_templates  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.cors_todo has changed
  ~ resource "aws_api_gateway_integration_response" "cors_todo" {
        id                  = "agir-l0w9e121i5-6f1z0j-OPTIONS-200"
      + response_templates  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_api_gateway_method.cors has changed
  ~ resource "aws_api_gateway_method" "cors" {
      + authorization_scopes = []
        id                   = "agm-l0w9e121i5-xsytmr-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # aws_api_gateway_method.cors_todo has changed
  ~ resource "aws_api_gateway_method" "cors_todo" {
      + authorization_scopes = []
        id                   = "agm-l0w9e121i5-6f1z0j-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # aws_api_gateway_method.todo has changed
  ~ resource "aws_api_gateway_method" "todo" {
      + authorization_scopes = []
        id                   = "agm-l0w9e121i5-6f1z0j-ANY"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # aws_api_gateway_method.todos has changed
  ~ resource "aws_api_gateway_method" "todos" {
      + authorization_scopes = []
        id                   = "agm-l0w9e121i5-xsytmr-ANY"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.cors has changed
  ~ resource "aws_api_gateway_method_response" "cors" {
        id                  = "agmr-l0w9e121i5-xsytmr-OPTIONS-200"
      + response_models     = {}
        # (6 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.cors_todo has changed
  ~ resource "aws_api_gateway_method_response" "cors_todo" {
        id                  = "agmr-l0w9e121i5-6f1z0j-OPTIONS-200"
      + response_models     = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.codebase will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "codebase" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "files/4515ef41-d30c-4117-75d8-2feebd63c94c.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../../dist"
      + type                = "zip"
    }

  # aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "sa-east-1"
      + rest_api_id  = "l0w9e121i5"
      + triggers     = (known after apply)
    }

  # aws_api_gateway_integration.todo will be created
  + resource "aws_api_gateway_integration" "todo" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + request_parameters      = {
          + "integration.request.path.todoId" = "method.request.path.todoId"
        }
      + resource_id             = "6f1z0j"
      + rest_api_id             = "l0w9e121i5"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.todos will be created
  + resource "aws_api_gateway_integration" "todos" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + resource_id             = "xsytmr"
      + rest_api_id             = "l0w9e121i5"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "sa-east-1"
      + rest_api_id   = "l0w9e121i5"
      + stage_name    = "dev"
      + tags_all      = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + web_acl_arn   = (known after apply)
    }

  # aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "api-tf-serverless-dev"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + region                          = "sa-east-1"
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = "sa-east-1_t8Q05LCGr"
      + version                         = (known after apply)
    }

  # aws_dynamodb_table.this will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "TodoId"
      + id               = (known after apply)
      + name             = "tf-serverless-dev"
      + range_key        = "UserId"
      + read_capacity    = (known after apply)
      + region           = "sa-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Done"
          + type = "S"
        }
      + attribute {
          + name = "TodoId"
          + type = "S"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "UserId"
          + name               = "TodosByUser"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "Done"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_openid_connect_provider.github[0] will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.terraform_dev[0] will be created
  + resource "aws_iam_role" "terraform_dev" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.terraform_prod[0] will be created
  + resource "aws_iam_role" "terraform_prod" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-prod-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.terraform_dev_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "terraform_dev_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "terraform-dev-role"
    }

  # aws_iam_role_policy_attachment.terraform_prod_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "terraform_prod_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "terraform-prod-role"
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tf-serverless-dev-dynamodb"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "sa-east-1"
      + source_arn          = "arn:aws:execute-api:sa-east-1:968339500772:l0w9e121i5/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.lambda_artefacts will be created
  + resource "aws_s3_bucket" "lambda_artefacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "968339500772-tf-serverless-lambda-artefacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "sa-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_object.lambda_artefact will be created
  + resource "aws_s3_object" "lambda_artefact" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/zip"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/4515ef41-d30c-4117-75d8-2feebd63c94c.zip"
      + kms_key_id             = (known after apply)
      + region                 = "sa-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "files/4515ef41-d30c-4117-75d8-2feebd63c94c.zip"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + version_id             = (known after apply)
    }

  # terraform_data.build is tainted, so must be replaced
+/- resource "terraform_data" "build" {
      ~ id               = "426acd2e-3460-7741-7e67-512ec86b2d22" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.iam_role_dynamodb_lambda.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "tf-serverless-dev-dynamodb-lambda-execute-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-dev/index/*",
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-dev",
                        ]
                      + Sid      = "AllowDynamoDBActions"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "AllowCreatingLogGroups"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/lambda/*:*"
                      + Sid      = "AllowWritingLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.iam_role_dynamodb_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-serverless-dev-dynamodb-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_role_dynamodb_lambda.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-serverless-dev-dynamodb-lambda-role"
    }

  # module.lambda_dynamodb.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/tf-serverless-dev-dynamodb"
      + name_prefix       = (known after apply)
      + region            = "sa-east-1"
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.lambda_dynamodb.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Triggered by API Gateway to save data into DynamoDB table"
      + function_name                  = "tf-serverless-dev-dynamodb"
      + handler                        = "lambdas/dynamodb.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "sa-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "968339500772-tf-serverless-lambda-artefacts"
      + s3_key                         = "builds/4515ef41-d30c-4117-75d8-2feebd63c94c.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_NODEJS_CONNECTION_REUSE_ENABLED" = "1"
              + "CORS_CREDS"                          = "'false'"
              + "CORS_HEADERS"                        = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
              + "CORS_METHODS"                        = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
              + "CORS_ORIGINS"                        = "'*'"
              + "DEBUG"                               = "true"
              + "GSI_NAME"                            = "TodosByUser"
              + "JWT_SECRET"                          = "609gjiok1h8uh33u576oehrlo6"
              + "TABLE_NAME"                          = "tf-serverless-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 20 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + lambda_dynamo_invoke_url = (known after apply)
  + tf_dev_role_arn          = (known after apply)
  + tf_prod_role_arn         = (known after apply)

```
</details>